<?php
/*
 * @Author       : lovefc
 * @Date         : 2022-09-03 02:11:36
 * @LastEditTime : 2022-10-21 17:14:35
 */

namespace FC;

class Tools
{
    // 显示颜色文字
    public static function colorFont($str, $font = '', $bg = '', $fs = '')
    {
        $c_fs = [
            '粗体' => 1,
            '非粗体' => 22,
            '下划线' => 4,
            '无下划线' => 24,
            '闪烁' => 5,
            '无闪烁' => 25,
            '反显' => 7,
            '无反显' => 27
        ];
        $c_bg = [
            '黑' => 40,
            '红' => 41,
            '绿' => 42,
            '黄' => 43,
            '蓝' => 44,
            '紫' => 45,
            '深绿' => 46,
            '白' => 47,
        ];
        $c_font = [
            '黑' => 30,
            '红' => 31,
            '绿' => 32,
            '黄' => 33,
            '蓝' => 34,
            '紫' => 35,
            '深绿 ' => 36,
            '白' => 37,
            '默认' => 0,
        ];
        $fs = $c_fs[$fs] ?? '';
        $bg = $c_bg[$bg] ?? '';
        $font = $c_font[$font] ?? '';
        return "\033[{$fs};{$bg};{$font}m{$str}\033[0m";
    }
}
